In [32]:
from pathlib import Path
import requests
import pandas as pd
import numpy as np
from io import StringIO
import shutil
import datetime
from datetime import datetime
import re
import json
from pandas.api.types import is_numeric_dtype
from simple_salesforce import Salesforce, format_soql, format_external_id
from simple_salesforce.exceptions import SalesforceMalformedRequest
import simpler_sf

simpler_sf.simple_salesforce()
with open("../login.json", "r") as j:
    misDatos = json.load(j)
# para smart query
""" sf = simple_salesforce.Salesforce(
    username=misDatos["username"],
    password=misDatos["password"],
    security_token=misDatos["security_token"],
)
 """
# para lo demas
sf = Salesforce(
    username=misDatos["username"],
    password=misDatos["password"],
    security_token=misDatos["security_token"],
)
# paramiko.util.log_to_file("paramiko.log")
regex = re.compile(r"([A-Za-z0-9]+[.-_])*[A-Za-z0-9]+@[A-Za-z0-9-]+(\.[A-Z|a-z]{2,})+")

In [33]:
sql = "select Id,Campa_a__c, Empresa__r.P_liza__c, Empresa__r.Name  from EmpresaContactoConvenios__c where Campa_a__c = 'MetLife'"
empresacontactoconvenio = sf.smart_query(sql)

100%|██████████| 1/1 [02:06<00:00, 126.81s/it]

In [4]:
query2 = "select P_liza__c, Nombre_de_Empresa__c,Identificador__c, Rut_Empresa__c, Empresa_Padre__r.Name, Empresa__r.name,Holding__c, Plan__c, Pais__c, Activo__c, Id from Datos_Empresa__c "
empresas = sf.smart_query(query2)

100%|██████████| 1/1 [00:09<00:00,  9.72s/it]

In [24]:
query2 = "select Name, Id,Account__r.Pa_s_del_Paciente__r.Name, Account__r.IdentificationId__pc,EmpresaContactoConvenio__c,Canal__c from Ficha_Cl_nica_Seg_Paciente_Cr_nico__c where Name = 'FCSC-12264' "
empresas = sf.smart_query(query2)

100%|██████████| 1/1 [00:03<00:00,  3.17s/it]

In [32]:
def Splitaer(empresas):
    derty = empresas.split(",")
    for i in range(0, len(derty)):
        print(derty[i])



derty4 = empresas["EmpresaContactoConvenio__c"].apply(lambda y: Splitaer(y))
derty4.head()

empresas.head()

a40RN000000qahbYAA
a40RN000000qahcYAA
a40RN000001E9LXYA0
a40RN000001EPhnYAG

,Name,Id,Account__r.IdentificationId__pc,EmpresaContactoConvenio__c,Canal__c
0,FCSC-12264,a1fRN000000NBkLYAW,130554601,"a40RN000000qahbYAA,a40RN000000qahcYAA,a40RN000...",Llamada

In [38]:
empresacontactoconvenio["uno"] = 1

In [50]:
empresacontactoconvenio.head()

                   Id Campa_a__c Empresa__r.P_liza__c Empresa__r.Name  uno
0  a40RN000001Day6YAC    MetLife            340023542   Convenio 7343    1
1  a40RN000001EGhMYAW    MetLife            340023542   Convenio 7343    1
2  a40RN000001ET0JYAW    MetLife            340023542   Convenio 7343    1
3  a40RN000001EmvvYAC    MetLife            340023542   Convenio 7343    1
4  a40RN000001EtaBYAS    MetLife            340023542   Convenio 7343    1

In [57]:
df_resume = pd.pivot_table(empresacontactoconvenio,
    index=['Campa_a__c','Empresa__r.P_liza__c'],
    columns='uno',
    values='Id',
    aggfunc='count'
)

In [53]:
df_resume = empresacontactoconvenio.pivot_table(
    index=("Empresa__r.P_liza__c"),
    #columns="Product",
    values="uno",
    aggfunc="sum",
)

In [58]:
df_resume

uno                                 1
Campa_a__c Empresa__r.P_liza__c
MetLife    -                       10
           330000004             6053
           340000508              904
           340000577             1960
           340000585              301
...                               ...
           340024960             2720
           340024961              136
           340024962               36
           340024970             3112
           340024973                1

[2863 rows x 1 columns]

In [62]:
df_resume.to_excel("F:/Empresas SF/reportes/metlife_ricardo.xlsx", index=True)

In [61]:
df_resume.head(9)

uno                                 1
Campa_a__c Empresa__r.P_liza__c
MetLife    -                       10
           330000004             6053
           340000508              904
           340000577             1960
           340000585              301
           340000644             7354
           340001374              740
           340001375               27
           340001376             1188

In [31]:
df_resume.shape

(2863, 1)